erickthenight/EcoStationEdu-Embarcatech/lib/FreeRTOS-Kernel/portable/ThirdParty/GCC/RP2040/port.c
    static spin_lock_t * pxYieldSpinLock[ configNUMBER_OF_CORES ];
    static uint32_t ulYieldSpinLockSaveValue[ configNUMBER_OF_CORES ];
#endif /* configSUPPORT_PICO_SYNC_INTEROP */

/*
 * The number of SysTick increments that make up one tick period.
 */
#if ( configUSE_TICKLESS_IDLE == 1 )
    static uint32_t ulTimerCountsForOneTick = 0;
#endif /* configUSE_TICKLESS_IDLE */

/*
 * The maximum number of tick periods that can be suppressed is limited by the
 * 24 bit resolution of the SysTick timer.
 */
#if ( configUSE_TICKLESS_IDLE == 1 )
    static uint32_t xMaximumPossibleSuppressedTicks = 0;
#endif /* configUSE_TICKLESS_IDLE */

/*
 * Compensate for the CPU cycles that pass while the SysTick is stopped (low
 * power functionality only.
 */
#if ( configUSE_TICKLESS_IDLE == 1 )
    static uint32_t ulStoppedTimerCompensation = 0;
#endif /* configUSE_TICKLESS_IDLE */

/*-----------------------------------------------------------*/

#define INVALID_PRIMARY_CORE_NUM 0xffu
/* The primary core number (the own which has the SysTick handler) */
static uint8_t ucPrimaryCoreNum = INVALID_PRIMARY_CORE_NUM;

/* Note: portIS_FREE_RTOS_CORE() also returns false until the scheduler is started */
#if ( portRUNNING_ON_BOTH_CORES == 1 )
    #define portIS_FREE_RTOS_CORE() (ucPrimaryCoreNum != INVALID_PRIMARY_CORE_NUM)
#else
    #define portIS_FREE_RTOS_CORE() (ucPrimaryCoreNum == get_core_num())
#endif

/*
 * See header file for description.
 */
StackType_t * pxPortInitialiseStack( StackType_t * pxTopOfStack,
                                     TaskFunction_t pxCode,
                                     void * pvParameters )
{
    /* Simulate the stack frame as it would be created by a context switch
     * interrupt. */
    pxTopOfStack--;                                          /* Offset added to account for the way the MCU uses the stack on entry/exit of interrupts. */
    *pxTopOfStack = portINITIAL_XPSR;                        /* xPSR */
    pxTopOfStack--;
    *pxTopOfStack = ( StackType_t ) pxCode;                  /* PC */
    pxTopOfStack--;
    *pxTopOfStack = ( StackType_t ) portTASK_RETURN_ADDRESS; /* LR */
    pxTopOfStack -= 5;                                       /* R12, R3, R2 and R1. */
    *pxTopOfStack = ( StackType_t ) pvParameters;            /* R0 */
    pxTopOfStack -= 8;                                       /* R11..R4. */

    return pxTopOfStack;
}
/*-----------------------------------------------------------*/

static void prvTaskExitError( void )
{
    /* A function that implements a task must not exit or attempt to return to
     * its caller as there is nothing to return to.  If a task wants to exit it
     * should instead call vTaskDelete( NULL ). */
    panic_unsupported();
}
/*-----------------------------------------------------------*/

void vPortSVCHandler( void )
{
    /* This function is no longer used, but retained for backward
     * compatibility. */
}
/*-----------------------------------------------------------*/

void vPortStartFirstTask( void )
{
#if ( configNUMBER_OF_CORES == 1 )
    __asm volatile (
        "   .syntax unified             \n"
        "   ldr  r2, pxCurrentTCBConst1 \n"/* Obtain location of pxCurrentTCB. */
        "   ldr  r3, [r2]               \n"
        "   ldr  r0, [r3]               \n"/* The first item in pxCurrentTCB is the task top of stack. */
        "   adds r0, #32                \n"/* Discard everything up to r0. */
        "   msr  psp, r0                \n"/* This is now the new top of stack to use in the task. */
        "   movs r0, #2                 \n"/* Switch to the psp stack. */
        "   msr  CONTROL, r0            \n"
        "   isb                         \n"
        "   pop  {r0-r5}                \n"/* Pop the registers that are saved automatically. */
        "   mov  lr, r5                 \n"/* lr is now in r5. */
        "   pop  {r3}                   \n"/* Return address is now in r3. */
        "   pop  {r2}                   \n"/* Pop and discard XPSR. */
        "   cpsie i                     \n"/* The first task has its context and interrupts can be enabled. */
        "   bx   r3                     \n"/* Finally, jump to the user defined task code. */
	"   .align 4                       \n"
	"pxCurrentTCBConst1: .word pxCurrentTCB\n"
    );
#else
    __asm volatile (
        "    .syntax unified                    \n"
        #if configRESET_STACK_POINTER
            "   ldr  r0, =0xE000ED08            \n" /* Use the NVIC offset register to locate the stack. */
            "   ldr r0, [r0]                    \n"
            "   ldr r0, [r0]                    \n"
            "   msr msp, r0                     \n" /* Set the msp back to the start of the stack. */
        #endif /* configRESET_STACK_POINTER */
        #if portRUNNING_ON_BOTH_CORES
            "   adr r1, ulAsmLocals             \n"/* Get the location of the current TCB for the current core. */
            "   ldmia r1!, {r2, r3}             \n"
            "   ldr r2, [r2]                    \n"/* r2 = Core number */
            "   lsls r2, #2                     \n"
            "   ldr r3, [r3, r2]                \n"/* r3 = pxCurrentTCBs[get_core_num()] */
        #else
            "   ldr r3, =pxCurrentTCBs          \n"
            "   ldr r3, [r3]                    \n" /* r3 = pxCurrentTCBs[0] */
        #endif /* portRUNNING_ON_BOTH_CORES */
        "    ldr  r0, [r3]                       \n"/* The first item in pxCurrentTCB is the task top of stack. */
        "    adds r0, #32                        \n"/* Discard everything up to r0. */
        "    msr  psp, r0                        \n"/* This is now the new top of stack to use in the task. */
        "    movs r0, #2                         \n"/* Switch to the psp stack. */
        "    msr  CONTROL, r0                    \n"
        "    isb                                 \n"
        "    pop  {r0-r5}                        \n"/* Pop the registers that are saved automatically. */
        "    mov  lr, r5                         \n"/* lr is now in r5. */
        "    pop  {r3}                           \n"/* Return address is now in r3. */
        "    pop  {r2}                           \n"/* Pop and discard XPSR. */
        "    cpsie i                             \n"/* The first task has its context and interrupts can be enabled. */
        "    bx   r3                             \n"/* Finally, jump to the user defined task code. */
        #if portRUNNING_ON_BOTH_CORES
            "                                   \n"
            "     .align 4                      \n"
            "ulAsmLocals:                       \n"
            "    .word 0xD0000000               \n"/* SIO */
            "    .word pxCurrentTCBs            \n"
        #endif /* portRUNNING_ON_BOTH_CORES */
    );
#endif
}
/*-----------------------------------------------------------*/

